#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/neptune-software/poc-seb-tfdevsecops/runs/run-WR5wPDhGbbPjgJfu[0m
[0m
Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_virtual_network.poc-vnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "poc-vnet" {
      [32m+[0m [0m[1m[0maddress_space[0m[0m         = [
          [32m+[0m [0m"10.0.0.0/16",
        ]
      [32m+[0m [0m[1m[0mguid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m              = "westeurope"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "vnet-poc-dev-westeurope"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "poc-tf"
      [32m+[0m [0m[1m[0msubnet[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mvm_protection_enabled[0m[0m = false
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m

```
</details>
*Pusher: @saguadob, Action: `pull_request`*